In [113]:
import numpy as np
import pandas as pd

# **series / seriler**

In [114]:
#numpy dizisine benzer ancak burda daha esnek. veri biliminin excel i diyebiliriz.

In [232]:
sozluk = {"atıl: " : 50, "zeynep: " : 40, "mehmet: " : 30}
pd.Series(sozluk)

atıl:       50
zeynep:     40
mehmet:     30
dtype: int64

In [117]:
isimler = ["atıl", "zeynep", "mehmet"]
yaslar = [50, 40, 30]

In [118]:
pd.Series(yaslar)

0    50
1    40
2    30
dtype: int64

In [119]:
pd.Series(isimler)

0      atıl
1    zeynep
2    mehmet
dtype: object

In [120]:
pd.Series(isimler, yaslar)

50      atıl
40    zeynep
30    mehmet
dtype: object

In [121]:
pd.Series(data = isimler, index = yaslar)

50      atıl
40    zeynep
30    mehmet
dtype: object

In [122]:
dizi = np.array([50, 40, 30])
dizi

array([50, 40, 30])

In [123]:
pd.Series(dizi)

0    50
1    40
2    30
dtype: int64

In [124]:
pd.Series(dizi, isimler)

atıl      50
zeynep    40
mehmet    30
dtype: int64

In [125]:
pd.Series([1, 2, 3], ["atil", "atlas", "osman"])

atil     1
atlas    2
osman    3
dtype: int64

In [126]:
yarısmaSonucu1 = pd.Series([10, 5, 1], ["atil", "atlas", "osman"])
yarısmaSonucu2 = pd.Series([20, 10, 8], ["atil", "atlas", "osman"])

In [127]:
yarısmaSonucu1["atlas"]

5

In [128]:
yarısmaSonucu1 + yarısmaSonucu2

atil     30
atlas    15
osman     9
dtype: int64

In [129]:
f1 = pd.Series([20, 30, 40, 50], ["a", "b", "c", "d"])
f2 = pd.Series([10, 5, 3, 1], ["a", "c", "f", "g"])

In [130]:
f1 + f2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

# **data frame**

In [131]:
#serilerin yan yana gelmesiyle oluşturulmuş, excel tablosu gibi düşünebileceğimiz bir yapı

In [132]:
data = np.random.randn(4 ,3)
data

array([[-1.44046266, -0.557389  , -1.73640886],
       [-0.84758536, -0.1426545 , -1.6485835 ],
       [ 1.69771879, -0.76681886, -0.70181415],
       [ 1.18034916,  1.3749767 , -1.89676124]])

In [133]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0 -1.440463 -0.557389 -1.736409
1 -0.847585 -0.142654 -1.648583
2  1.697719 -0.766819 -0.701814
3  1.180349  1.374977 -1.896761

In [134]:
dataFrame[0]

0   -1.440463
1   -0.847585
2    1.697719
3    1.180349
Name: 0, dtype: float64

In [233]:
yeniDataFrame = pd.DataFrame(data, index = ["atil", "zeynep", "atlas", "mehmet"], columns = ["maas", "yas", "çalışma saati"])
yeniDataFrame

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas   1.697719 -0.766819      -0.701814
mehmet  1.180349  1.374977      -1.896761

In [137]:
yeniDataFrame["yas"]

atil     -0.557389
zeynep   -0.142654
atlas    -0.766819
mehmet    1.374977
Name: yas, dtype: float64

In [138]:
yeniDataFrame[["maas", "yas"]]

            maas       yas
atil   -1.440463 -0.557389
zeynep -0.847585 -0.142654
atlas   1.697719 -0.766819
mehmet  1.180349  1.374977

In [139]:
yeniDataFrame.loc["atil"] # satır almak için, location dan geliyor

maas            -1.440463
yas             -0.557389
çalışma saati   -1.736409
Name: atil, dtype: float64

In [140]:
yeniDataFrame.iloc[1] #index location

maas            -0.847585
yas             -0.142654
çalışma saati   -1.648583
Name: zeynep, dtype: float64

In [234]:
yeniDataFrame["emeklilik yası"] = yeniDataFrame["yas"] + yeniDataFrame["yas"] #yaşının 2 katı emeklilik yaşına eşit olsun
yeniDataFrame

            maas       yas  çalışma saati  emeklilik yası
atil   -1.440463 -0.557389      -1.736409       -1.114778
zeynep -0.847585 -0.142654      -1.648583       -0.285309
atlas   1.697719 -0.766819      -0.701814       -1.533638
mehmet  1.180349  1.374977      -1.896761        2.749953

In [143]:
yeniDataFrame.drop("emeklilik yası", axis = 1) #işlemi yapar ancak asıl tablo değişmez (axis = 1 arama işlemini sütunlarda yapar)

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas   1.697719 -0.766819      -0.701814
mehmet  1.180349  1.374977      -1.896761

In [144]:
yeniDataFrame.drop("mehmet", axis = 0)  # axis = 0 arama işlemini satırlarda yapar

            maas       yas  çalışma saati  emeklilik yası
atil   -1.440463 -0.557389      -1.736409       -1.114778
zeynep -0.847585 -0.142654      -1.648583       -0.285309
atlas   1.697719 -0.766819      -0.701814       -1.533638

In [145]:
yeniDataFrame

            maas       yas  çalışma saati  emeklilik yası
atil   -1.440463 -0.557389      -1.736409       -1.114778
zeynep -0.847585 -0.142654      -1.648583       -0.285309
atlas   1.697719 -0.766819      -0.701814       -1.533638
mehmet  1.180349  1.374977      -1.896761        2.749953

In [235]:
yeniDataFrame.drop("emeklilik yası", axis = 1, inplace=True) #işlemi yapar ve tabloda da bu değişiklik görünür
yeniDataFrame

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas   1.697719 -0.766819      -0.701814
mehmet  1.180349  1.374977      -1.896761

In [148]:
yeniDataFrame.loc["atlas"]["yas"]

-0.7668188579426509

In [149]:
yeniDataFrame.loc["atlas", "yas"]

-0.7668188579426509

In [150]:
yeniDataFrame < 0

         maas    yas  çalışma saati
atil     True   True           True
zeynep   True   True           True
atlas   False   True           True
mehmet  False  False           True

In [236]:
booleanFrame = yeniDataFrame < 0
yeniDataFrame[booleanFrame]

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas        NaN -0.766819      -0.701814
mehmet       NaN       NaN      -1.896761

In [153]:
yeniDataFrame[yeniDataFrame < 0]

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas        NaN -0.766819      -0.701814
mehmet       NaN       NaN      -1.896761

In [154]:
yeniDataFrame[yeniDataFrame["yas"] > 0]

            maas       yas  çalışma saati
mehmet  1.180349  1.374977      -1.896761

In [155]:
yeniDataFrame

            maas       yas  çalışma saati
atil   -1.440463 -0.557389      -1.736409
zeynep -0.847585 -0.142654      -1.648583
atlas   1.697719 -0.766819      -0.701814
mehmet  1.180349  1.374977      -1.896761

In [156]:
yeniDataFrame.reset_index()

    index      maas       yas  çalışma saati
0    atil -1.440463 -0.557389      -1.736409
1  zeynep -0.847585 -0.142654      -1.648583
2   atlas  1.697719 -0.766819      -0.701814
3  mehmet  1.180349  1.374977      -1.896761

In [157]:
yeniIndexListesi = ["ati", "zey", "atl", "meh"]

In [237]:
yeniDataFrame["yeni index"] = yeniIndexListesi
yeniDataFrame

            maas       yas  çalışma saati yeni index
atil   -1.440463 -0.557389      -1.736409        ati
zeynep -0.847585 -0.142654      -1.648583        zey
atlas   1.697719 -0.766819      -0.701814        atl
mehmet  1.180349  1.374977      -1.896761        meh

In [238]:
yeniDataFrame.set_index("yeni index", inplace = True)
yeniDataFrame

                maas       yas  çalışma saati
yeni index
ati        -1.440463 -0.557389      -1.736409
zey        -0.847585 -0.142654      -1.648583
atl         1.697719 -0.766819      -0.701814
meh         1.180349  1.374977      -1.896761

In [162]:
yeniDataFrame.loc["ati"]

maas            -1.440463
yas             -0.557389
çalışma saati   -1.736409
Name: ati, dtype: float64

In [229]:
ilkIndeksler = ["simpson", "simpson", "simpson", "south park", "south park", "south park"]
icIndeksler = ["homer", "bart", "marge", "cartman", "kenny", "kyle"]

birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))  #zip birleştiriyor
birlesmisIndeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [230]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)
birlesmisIndeks

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [227]:
liste = [[40, "a"], [10, "b"], [30, "c"], [9, "d"], [10, "e"], [11, "f"]]

listeNumpy = np.array(liste)
listeNumpy

array([['40', 'a'],
       ['10', 'b'],
       ['30', 'c'],
       ['9', 'd'],
       ['10', 'e'],
       ['11', 'f']], dtype='<U21')

In [226]:
cizgiDataFrame = pd.DataFrame(listeNumpy, index = birlesmisIndeks, columns = ["yas", "meslek"])

cizgiDataFrame

                   yas meslek
film adı   isim
simpson    homer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f

In [174]:
cizgiDataFrame.loc["simpson"]

      yas meslek
homer  40      a
bart   10      b
marge  30      c

In [175]:
cizgiDataFrame.loc["simpson"].loc["bart"]

yas       10
meslek     b
Name: bart, dtype: object

In [176]:
cizgiDataFrame.index.names = ["film adı", "isim"]

In [177]:
cizgiDataFrame

                   yas meslek
film adı   isim
simpson    homer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f

# **Pandas Operasyonlar**

In [178]:
sozlukVerisi = {"istanbul": [30,29,np.nan], "ankara": [20,np.nan,25], "izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [179]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [180]:
havaDurumuDataFrame.dropna(axis = 1)

   izmir
0     40
1     39
2     38

In [181]:
yeniVeri = {"istanbul": [30,29,np.nan], "ankara": [20,np.nan,25], "izmir": [40,39,38], "antalya": [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [182]:
yeniDataFrame.dropna(axis=1, thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [183]:
yeniDataFrame.fillna(20) #boş hücreleri dolduruyor

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## **groupby**
---

In [231]:
maasSozlugu = {"Departman": ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
              "Çalışan İsim": ["Ahmet", "Mehmet", "Atıl", "Burak", "Zeynep", "Fatma"],
              "Maaş": [100, 150, 200, 300, 400, 500]}

maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Çalışan İsim  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [190]:
grupObje = maasDataFrame.groupby("Departman")

In [191]:
grupObje.count()

           Çalışan İsim  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [194]:
grupObje.sum()

          Çalışan İsim  Maaş
Departman
Hukuk      ZeynepFatma   900
Pazarlama    AtılBurak   500
Yazılım    AhmetMehmet   250

In [195]:
grupObje.max()

          Çalışan İsim  Maaş
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [197]:
grupObje.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## **concatenation/concat (birleştirme)**
---

In [198]:
sozluk1 = {"isim": ["ahmet", "mehmet", "zeynep", "atıl"],
          "spor": ["koşu", "yüzme", "koşu", "basketbol"],
          "kalori": [100, 200, 300, 400]}

dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])
dataFrame1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     300
3    atıl  basketbol     400

In [200]:
sozluk2 = {"isim": ["osman", "levent", "atlas", "fatma"],
          "spor": ["koşu", "yüzme", "koşu", "basketbol"],
          "kalori": [100, 200, 250, 150]}

dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])
dataFrame2

     isim       spor  kalori
4   osman       koşu     100
5  levent      yüzme     200
6   atlas       koşu     250
7   fatma  basketbol     150

In [203]:
sozluk3 = {"isim": ["ayşe", "mahmut", "duygu", "nur"],
          "spor": ["koşu", "yüzme", "badminton", "tenis"],
          "kalori": [400, 500, 100, 200]}

dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])
dataFrame3

      isim       spor  kalori
8     ayşe       koşu     400
9   mahmut      yüzme     500
10   duygu  badminton     100
11     nur      tenis     200

In [207]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 1)

,isim,spor,kalori,isim,spor,kalori,isim,spor,kalori
0,ahmet,koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,mehmet,yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,zeynep,koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,atıl,basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,osman,koşu,100.0,NaN,NaN,NaN
5,NaN,NaN,NaN,levent,yüzme,200.0,NaN,NaN,NaN
6,NaN,NaN,NaN,atlas,koşu,250.0,NaN,NaN,NaN
7,NaN,NaN,NaN,fatma,basketbol,150.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,ayşe,koşu,400.0
9,NaN,NaN,NaN,NaN,NaN,NaN,mahmut,yüzme,500.0
10,NaN,NaN,NaN,NaN,NaN,NaN,duygu,badminton,100.0
11,NaN,NaN,NaN,NaN,NaN,NaN,nur,tenis,200.0

In [208]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yüzme     200
2   zeynep       koşu     300
3     atıl  basketbol     400
4    osman       koşu     100
5   levent      yüzme     200
6    atlas       koşu     250
7    fatma  basketbol     150
8     ayşe       koşu     400
9   mahmut      yüzme     500
10   duygu  badminton     100
11     nur      tenis     200

## **merge**
---

In [210]:
mergeSozluk1 = {"isim": ["ahmet", "mehmet", "zeynep", "atıl"],
               "spor": ["koşu", "yüzme", "koşu", "basketbol"],
               }
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame1

     isim       spor
0   ahmet       koşu
1  mehmet      yüzme
2  zeynep       koşu
3    atıl  basketbol

In [211]:
mergeSozluk2 = {"isim": ["ahmet", "mehmet", "zeynep", "atıl"],
               "kalori": [100,200,150,250],
               }
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     150
3    atıl     250

In [212]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on="isim")

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     150
3    atıl  basketbol     250

In [214]:
maasSozluk = {"isim": ["atıl", "zeynep", "mehmet", "ahmet"],
             "Departman": ["Yazılım", "Satış", "Pazarlama","Yazılım"],
             "Maaş": [200,300,400,500]
             }
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     isim  Departman  Maaş
0    atıl    Yazılım   200
1  zeynep      Satış   300
2  mehmet  Pazarlama   400
3   ahmet    Yazılım   500

In [215]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [217]:
maasDataFrame["Departman"].unique() #benzersiz olarak getiriyor

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [218]:
maasDataFrame["Departman"].nunique()

3

In [219]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [222]:
def bruttenNete(maas):
    return maas * 0.66

In [223]:
maasDataFrame["Maaş"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maaş, dtype: float64

In [224]:
maasDataFrame.isnull()

    isim  Departman   Maaş
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [240]:
yeniVeri = {"karakter sınıfı": ["south park", "south park", "simpson", "simpson", "simpson"],
           "karakter ismi": ["cartman", "kenny", "homer", "bart", "bart"],
           "yaş": [9,10,50,20,10]}

yeniVeriDataFrame = pd.DataFrame(yeniVeri)
yeniVeriDataFrame

  karakter sınıfı karakter ismi  yaş
0      south park       cartman    9
1      south park         kenny   10
2         simpson         homer   50
3         simpson          bart   20
4         simpson          bart   10

In [241]:
yeniVeriDataFrame.pivot_table(values="yaş", index=["karakter sınıfı", "karakter ismi"])

                                yaş
karakter sınıfı karakter ismi
simpson         bart           15.0
                homer          50.0
south park      cartman         9.0
                kenny          10.0

In [244]:
yeniVeriDataFrame.pivot_table(values="yaş", index=["karakter sınıfı", "karakter ismi"], aggfunc=np.sum)

/var/folders/9g/5bgf0gcn7f755k1kh7ljlmxr0000gn/T/ipykernel_68323/2599199212.py:1: FutureWarning: The provided callable <function sum at 0x119b61f80> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  yeniVeriDataFrame.pivot_table(values="yaş", index=["karakter sınıfı", "karakter ismi"], aggfunc=np.sum)

                               yaş
karakter sınıfı karakter ismi
simpson         bart            30
                homer           50
south park      cartman          9
                kenny           10